database/redis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-03 Tue 09:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Redis</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Redis</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2430543">1. Redis 特性</a></li>
<li><a href="#org2969a5e">2. Redis 使用场景</a></li>
<li><a href="#org3983dd0">3. Redis 的安装及使用</a></li>
<li><a href="#orgbfb1056">4. Redis 的数据类型</a></li>
<li><a href="#org48c0756">5. 相关连接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org2430543" class="outline-2">
<h2 id="org2430543"><span class="section-number-2">1</span> Redis 特性</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>速度快
<ul class="org-ul">
<li>内存数据库</li>
<li>I/O 多路复用</li>
<li>协议简单</li>
<li>C 语言开发</li>
</ul></li>
<li>键值对的数据结构服务器
<ul class="org-ul">
<li>key 永远是 String</li>
<li>value 可以</li>
</ul></li>
<li>丰富的功能</li>
<li>简单稳定
<ul class="org-ul">
<li>主线程是单线程</li>
</ul></li>
<li>持久化
<ul class="org-ul">
<li>RDB (Redis DataBase)</li>
<li>AOF (Append-Only File)</li>
</ul></li>
<li>主从复制</li>
<li>高可用和分布式转移</li>
<li>客户端语言多</li>
</ol>
</div>
</div>

<div id="outline-container-org2969a5e" class="outline-2">
<h2 id="org2969a5e"><span class="section-number-2">2</span> Redis 使用场景</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>缓存数据库</li>
<li>排行榜</li>
<li>计数器</li>
<li>社交网络</li>
<li>消息队列</li>
<li>分布式锁</li>
</ol>
</div>
</div>

<div id="outline-container-org3983dd0" class="outline-2">
<h2 id="org3983dd0"><span class="section-number-2">3</span> Redis 的安装及使用</h2>
<div class="outline-text-2" id="text-3">
<p>
下载并安装
</p>
<div class="org-src-container">
<pre class="src src-sh">wget https://download.redis.io/releases/redis-6.2.5.tar.gz
tar xzf redis-6.2.5.tar.gz
<span style="color: #4f97d7;">cd</span> redis-6.2.5
make
</pre>
</div>

<p>
启动 Redis Server
</p>
<div class="org-src-container">
<pre class="src src-sh">src/redis-server
</pre>
</div>

<p>
客户端连接 Redis
</p>
<div class="org-src-container">
<pre class="src src-sh">$ src/redis-cli
redis&gt; set foo bar
OK
redis&gt; get foo
<span style="color: #2d9574;">"bar"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfb1056" class="outline-2">
<h2 id="orgbfb1056"><span class="section-number-2">4</span> Redis 的数据类型</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>string 字符串, 整数, 浮点数
<ul class="org-ul">
<li>二进制安全, 可以存储图片和序列化对象, 最多可存储 512M 的数据</li>
<li>get/set/del</li>
<li>mset 多个键设置</li>
<li>incr/decr</li>
<li>strlen/append</li>
</ul></li>
<li>hash 哈希表
<ul class="org-ul">
<li>hmset/hget/hgetall</li>
<li>物理存储会在 ziplist 和 hashtable 两种类型中转换</li>
</ul></li>
<li>list 列表
<ul class="org-ul">
<li>列表是一个双向链表, 最多存储 <code>2^32-1</code> 个元素</li>
<li>lpush/lpop/rpush/rpop</li>
<li>lrange key 0 10</li>
<li>llen</li>
</ul></li>
<li>set 集合
<ul class="org-ul">
<li>sadd/smembers</li>
</ul></li>
<li>zset 有序集合
<ul class="org-ul">
<li>有序的集合类型, 键是不可重复的</li>
<li>zadd</li>
</ul></li>
</ol>

<p>
整数操作
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1:6379&gt; flushdb
OK
127.0.0.1:6379&gt; set hello 'world'
OK
127.0.0.1:6379&gt; keys *
1) "hello"
127.0.0.1:6379&gt; get hello
"world"
127.0.0.1:6379&gt; append hello '!'
(integer) 6
127.0.0.1:6379&gt; get hello
"world!"
</pre>
</div>

<p>
计数器
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1:6379&gt; set count 1
OK
127.0.0.1:6379&gt; incr count
(integer) 2
127.0.0.1:6379&gt; get count
"2"
127.0.0.1:6379&gt; incr count
(integer) 3
127.0.0.1:6379&gt;
</pre>
</div>

<p>
哈希使用
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1:6379&gt; flushdb
OK
127.0.0.1:6379&gt; hmset user name zhang age 12
OK
127.0.0.1:6379&gt; hgetall user
1) "name"
2) "zhang"
3) "age"
4) "12"
</pre>
</div>

<p>
集合操作
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1:6379&gt; sadd course math
(integer) 1
127.0.0.1:6379&gt; sadd course chinese
(integer) 1
127.0.0.1:6379&gt; object encoding course
"hashtable"
127.0.0.1:6379&gt; smembers course
1) "math"
2) "chinese"
</pre>
</div>

<p>
获取对象存储类型
</p>
<div class="org-src-container">
<pre class="src src-text">127.0.0.1:6379&gt; keys *
1) "a"
2) "str1"
127.0.0.1:6379&gt; object encoding a
"quicklist"
127.0.0.1:6379&gt; object encoding str1
"embstr"
</pre>
</div>
</div>
</div>

<div id="outline-container-org48c0756" class="outline-2">
<h2 id="org48c0756"><span class="section-number-2">5</span> 相关连接</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://redis.io/">Redis Official Site</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-08-03 Tue 09:29. Created by Jinghui Hu at 2021-07-07 Wed 16:51.</p>
</div>
</body>
</html>
